saitronkarthi/Over-the-Air-OAD-of-SensorTag-CC2650-Firmware-Android-App/SensorTag source/CC26xx/CCS/SensorTag/FlashOnlyOAD/configPkg/package/cfg/appBLE_pem3.c
/* A_tooManyCallsReleaseDependency__C */
#pragma DATA_SECTION(ti_sysbios_family_arm_cc26xx_Power_A_tooManyCallsReleaseDependency__C, ".const:ti_sysbios_family_arm_cc26xx_Power_A_tooManyCallsReleaseDependency__C");
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_A_tooManyCallsReleaseDependency ti_sysbios_family_arm_cc26xx_Power_A_tooManyCallsReleaseDependency__C = (((xdc_runtime_Assert_Id)0) << 16 | 16);

/* resumeTicksSTANDBY__C */
#pragma DATA_SECTION(ti_sysbios_family_arm_cc26xx_Power_resumeTicksSTANDBY__C, ".const:ti_sysbios_family_arm_cc26xx_Power_resumeTicksSTANDBY__C");
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_resumeTicksSTANDBY ti_sysbios_family_arm_cc26xx_Power_resumeTicksSTANDBY__C = (xdc_UInt)0x4b;

/* totalTicksSTANDBY__C */
#pragma DATA_SECTION(ti_sysbios_family_arm_cc26xx_Power_totalTicksSTANDBY__C, ".const:ti_sysbios_family_arm_cc26xx_Power_totalTicksSTANDBY__C");
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_totalTicksSTANDBY ti_sysbios_family_arm_cc26xx_Power_totalTicksSTANDBY__C = (xdc_UInt)0x64;

/* wakeDelaySTANDBY__C */
#pragma DATA_SECTION(ti_sysbios_family_arm_cc26xx_Power_wakeDelaySTANDBY__C, ".const:ti_sysbios_family_arm_cc26xx_Power_wakeDelaySTANDBY__C");
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_wakeDelaySTANDBY ti_sysbios_family_arm_cc26xx_Power_wakeDelaySTANDBY__C = (xdc_UInt)0x82;

/* initialWaitXOSC_HF__C */
#pragma DATA_SECTION(ti_sysbios_family_arm_cc26xx_Power_initialWaitXOSC_HF__C, ".const:ti_sysbios_family_arm_cc26xx_Power_initialWaitXOSC_HF__C");
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_initialWaitXOSC_HF ti_sysbios_family_arm_cc26xx_Power_initialWaitXOSC_HF__C = (xdc_UInt)0x32;

/* retryWaitXOSC_HF__C */
#pragma DATA_SECTION(ti_sysbios_family_arm_cc26xx_Power_retryWaitXOSC_HF__C, ".const:ti_sysbios_family_arm_cc26xx_Power_retryWaitXOSC_HF__C");
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_retryWaitXOSC_HF ti_sysbios_family_arm_cc26xx_Power_retryWaitXOSC_HF__C = (xdc_UInt)0x32;

/* calibrateRCOSC__C */
#pragma DATA_SECTION(ti_sysbios_family_arm_cc26xx_Power_calibrateRCOSC__C, ".const:ti_sysbios_family_arm_cc26xx_Power_calibrateRCOSC__C");
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_calibrateRCOSC ti_sysbios_family_arm_cc26xx_Power_calibrateRCOSC__C = 1;

/* clockFunc__C */
#pragma DATA_SECTION(ti_sysbios_family_arm_cc26xx_Power_clockFunc__C, ".const:ti_sysbios_family_arm_cc26xx_Power_clockFunc__C");
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_clockFunc ti_sysbios_family_arm_cc26xx_Power_clockFunc__C = ((CT__ti_sysbios_family_arm_cc26xx_Power_clockFunc)((xdc_Fxn)ti_sysbios_family_arm_cc26xx_Power_defaultClockFunc__E));

/* lfClockFunc__C */
#pragma DATA_SECTION(ti_sysbios_family_arm_cc26xx_Power_lfClockFunc__C, ".const:ti_sysbios_family_arm_cc26xx_Power_lfClockFunc__C");
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_lfClockFunc ti_sysbios_family_arm_cc26xx_Power_lfClockFunc__C = ((CT__ti_sysbios_family_arm_cc26xx_Power_lfClockFunc)((xdc_Fxn)ti_sysbios_family_arm_cc26xx_Power_LF_clockFunc__E));

/* xoscClockFunc__C */
#pragma DATA_SECTION(ti_sysbios_family_arm_cc26xx_Power_xoscClockFunc__C, ".const:ti_sysbios_family_arm_cc26xx_Power_xoscClockFunc__C");
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_xoscClockFunc ti_sysbios_family_arm_cc26xx_Power_xoscClockFunc__C = ((CT__ti_sysbios_family_arm_cc26xx_Power_xoscClockFunc)((xdc_Fxn)ti_sysbios_family_arm_cc26xx_Power_XOSC_HF_clockFunc__E));

/* notifyTrapFunc__C */
#pragma DATA_SECTION(ti_sysbios_family_arm_cc26xx_Power_notifyTrapFunc__C, ".const:ti_sysbios_family_arm_cc26xx_Power_notifyTrapFunc__C");
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_notifyTrapFunc ti_sysbios_family_arm_cc26xx_Power_notifyTrapFunc__C = ((CT__ti_sysbios_family_arm_cc26xx_Power_notifyTrapFunc)((xdc_Fxn)ti_sysbios_family_arm_cc26xx_Power_defaultNotifyTrapFunc__E));


/*
 * ======== ti.sysbios.family.arm.cc26xx.Timer INITIALIZERS ========
 */


/* Object__PARAMS__C */
#pragma DATA_SECTION(ti_sysbios_family_arm_cc26xx_Timer_Object__PARAMS__C, ".const:ti_sysbios_family_arm_cc26xx_Timer_Object__PARAMS__C");
__FAR__ const ti_sysbios_family_arm_cc26xx_Timer_Params ti_sysbios_family_arm_cc26xx_Timer_Object__PARAMS__C = {
    sizeof (ti_sysbios_family_arm_cc26xx_Timer_Params), /* __size */
    0, /* __self */
    0, /* __fxns */
    (xdc_runtime_IInstance_Params*)&ti_sysbios_family_arm_cc26xx_Timer_Object__PARAMS__C.__iprms, /* instance */
    ti_sysbios_interfaces_ITimer_RunMode_CONTINUOUS,  /* runMode */
    ti_sysbios_interfaces_ITimer_StartMode_AUTO,  /* startMode */
    ((xdc_UArg)0),  /* arg */
    (xdc_UInt32)0x0,  /* period */
    ti_sysbios_interfaces_ITimer_PeriodType_MICROSECS,  /* periodType */
    {
        (xdc_Bits32)0x0,  /* hi */
        (xdc_Bits32)0x0,  /* lo */
    },  /* extFreq */
    ((ti_sysbios_family_arm_m3_Hwi_Params*)0),  /* hwiParams */
    {
        sizeof (xdc_runtime_IInstance_Params), /* __size */
        0,  /* name */
    },  /* instance */
};

/* Module__root__V */
ti_sysbios_family_arm_cc26xx_Timer_Module__ ti_sysbios_family_arm_cc26xx_Timer_Module__root__V = {
    {&ti_sysbios_family_arm_cc26xx_Timer_Module__root__V.link,  /* link.next */
    &ti_sysbios_family_arm_cc26xx_Timer_Module__root__V.link},  /* link.prev */
};

/* Object__table__V */
ti_sysbios_family_arm_cc26xx_Timer_Object__ ti_sysbios_family_arm_cc26xx_Timer_Object__table__V[1] = {
    {/* instance#0 */
        0,
        1,  /* staticInst */
        (xdc_Int)0x0,  /* id */
        ti_sysbios_interfaces_ITimer_StartMode_AUTO,  /* startMode */
        (xdc_UInt32)0xa7c5,  /* period */
        ((xdc_UArg)0),  /* arg */
        ((xdc_Void(*)(xdc_UArg))((xdc_Fxn)ti_sysbios_knl_Clock_doTick__I)),  /* tickFxn */
        {
            (xdc_Bits32)0x0,  /* hi */
            (xdc_Bits32)0x10000,  /* lo */
        },  /* frequency */
        (ti_sysbios_family_arm_m3_Hwi_Handle)&ti_sysbios_family_arm_m3_Hwi_Object__table__V[1],  /* hwi */
        (xdc_UInt64)0xa7c5,  /* period64 */
        (xdc_UInt64)0x0,  /* savedCurrCount */
        (xdc_UInt64)0xa7c5,  /* prevThreshold */
        (xdc_UInt64)0xa7c5,  /* nextThreshold */
    },
};

