saitronkarthi/Over-the-Air-OAD-of-SensorTag-CC2650-Firmware-Android-App/SensorTag source/CC26xx/CCS/SensorTag/FlashOnlyOAD/configPkg/package/cfg/appBLE_pem3.c
/*
 * ======== ti.sysbios.knl.Task_SupportProxy INITIALIZERS ========
 */


/*
 * ======== ti.sysbios.rom.cortexm.cc26xx.CC26xx INITIALIZERS ========
 */

/* Module__diagsEnabled__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__diagsEnabled__C, ".const:ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__diagsEnabled__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__diagsEnabled ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__diagsEnabled__C = (xdc_Bits32)0x80;

/* Module__diagsIncluded__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__diagsIncluded__C, ".const:ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__diagsIncluded__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__diagsIncluded ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__diagsIncluded__C = (xdc_Bits32)0x80;

/* Module__diagsMask__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__diagsMask__C, ".const:ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__diagsMask__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__diagsMask ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__diagsMask__C = ((CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__diagsMask)0);

/* Module__gateObj__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__gateObj__C, ".const:ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__gateObj__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__gateObj ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__gateObj__C = ((CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__gateObj)0);

/* Module__gatePrms__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__gatePrms__C, ".const:ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__gatePrms__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__gatePrms ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__gatePrms__C = ((CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__gatePrms)0);

/* Module__id__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__id__C, ".const:ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__id__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__id ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__id__C = (xdc_Bits16)0x18;

/* Module__loggerDefined__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerDefined__C, ".const:ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerDefined__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerDefined ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerDefined__C = 0;

/* Module__loggerObj__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerObj__C, ".const:ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerObj__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerObj ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerObj__C = ((CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerObj)0);

/* Module__loggerFxn0__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn0__C, ".const:ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn0__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn0 ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn0__C = ((CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn0)0);

/* Module__loggerFxn1__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn1__C, ".const:ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn1__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn1 ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn1__C = ((CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn1)0);

/* Module__loggerFxn2__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn2__C, ".const:ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn2__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn2 ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn2__C = ((CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn2)0);

/* Module__loggerFxn4__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn4__C, ".const:ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn4__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn4 ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn4__C = ((CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn4)0);

/* Module__loggerFxn8__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn8__C, ".const:ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn8__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn8 ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn8__C = ((CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn8)0);

/* Module__startupDoneFxn__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__startupDoneFxn__C, ".const:ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__startupDoneFxn__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__startupDoneFxn ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__startupDoneFxn__C = ((CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__startupDoneFxn)0);

/* Object__count__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_CC26xx_Object__count__C, ".const:ti_sysbios_rom_cortexm_cc26xx_CC26xx_Object__count__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Object__count ti_sysbios_rom_cortexm_cc26xx_CC26xx_Object__count__C = 0;

/* Object__heap__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_CC26xx_Object__heap__C, ".const:ti_sysbios_rom_cortexm_cc26xx_CC26xx_Object__heap__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Object__heap ti_sysbios_rom_cortexm_cc26xx_CC26xx_Object__heap__C = 0;

/* Object__sizeof__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_CC26xx_Object__sizeof__C, ".const:ti_sysbios_rom_cortexm_cc26xx_CC26xx_Object__sizeof__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Object__sizeof ti_sysbios_rom_cortexm_cc26xx_CC26xx_Object__sizeof__C = 0;

